thmalmeida/STM32F10y/src/main.cpp
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "acionna.h"
#include "loadCell.h"
#include <time.h>
#include <stm32f10x.h>
#include <stm32f10x_rtc.h>
#include "stm32f10x_it.h"
#include "Hardware/adc.h"

#include "nokia5110/nokia5110.h"
#include "nokia5110/fonts/fonts.h"

ACIONNA acn;
ADC convert;

LOADCELL weight1;
LOADCELL weight2;
LOADCELL weight3;
LOADCELL weight4;

NOKIA5110 glcd;

// Wake up interrupts
//uint8_t flag_WDRF = 0;			// Watchdog System Reset Flag
//uint8_t flag_BORF = 0;			// Brown-out Reset Flag
//uint8_t flag_EXTRF = 0;			// External Reset Flag
//uint8_t flag_PORF = 0;			// Power-on Reset Flag
//uint16_t var = 0x0003;
int P[5];
uint8_t mode =0;
void showResults()
{
	switch (mode)
	{
		case 0:
			P[0] = P[1]+P[2]+P[3]+P[4];

			if(P[mode]/100%10 < 0)
			{
				if((P[mode]/1000) == 0)
				{
					glcd.glcd_dot_print(31,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(31,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(48,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[mode])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[mode]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(0,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[mode]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;
			break;
		case 1:
		{
			if(P[mode]/100%10 < 0)
			{
				if((P[mode]/1000) == 0)
				{
					glcd.glcd_dot_print(31,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(31,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(48,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[mode])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[mode]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(0,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[mode]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight1.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight1.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

			sprintf(Serial.buffer,"s%d", mode);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
		}
		break;
		case 2:
		{
			if(P[mode]/100%10 < 0)
			{
				if((P[mode]/1000) == 0)
				{
					glcd.glcd_dot_print(31,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(31,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(48,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[mode])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[mode]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(0,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[mode]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight2.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight2.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

			sprintf(Serial.buffer,"s%d", mode);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
		}
		break;
		case 3:
		{
			if(P[mode]/100%10 < 0)
			{
				if((P[mode]/1000) == 0)
				{
					glcd.glcd_dot_print(31,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(31,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(48,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[mode])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[mode]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(0,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[mode]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight3.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight3.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

			sprintf(Serial.buffer,"s%d", mode);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
		}
		break;
		case 4:
		{
			if(P[mode]/100%10 < 0)
			{
				if((P[mode]/1000) == 0)
				{
					glcd.glcd_dot_print(31,2,9,0xC0);					// minus signal;
					glcd.glcd_dot_print(31,3,9,0x01);					// minus signal;
					glcd.glcd_Arial16x24_str(48,1,"0");				// 0 digitos;
				}

				sprintf(Serial.buffer,"%.1d", abs(P[mode])/100%10);	// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);

			}
			else
			{
				sprintf(Serial.buffer,"%4.1d", P[mode]/1000);				// 0 digitos;
				glcd.glcd_Arial16x24_str(0,1,Serial.buffer);

				sprintf(Serial.buffer,"%.1d", P[mode]/100%10);			// 1 digitos; divide by centesimum part and use 10 by 10.
				glcd.glcd_Arial16x24_str(68,1,Serial.buffer);
			}
			glcd.glcd_dot_print(65,4,3,0x07);						// dot digit;
			glcd.glcd_put_string(72,5,"kg");						// unit print;

			sprintf(Serial.buffer,"o: %8d", weight4.offset);		// offset show;
			glcd.glcd_put_string(0,5,Serial.buffer);

			sprintf(Serial.buffer,"s: %8d", weight4.signal);		// signal show;
			glcd.glcd_put_string(0,0,Serial.buffer);

			sprintf(Serial.buffer,"s%d", mode);						// mode print;
			glcd.glcd_put_string(72,0,Serial.buffer);
		}
		break;
		case 5:
			P[0] = P[1]+P[2]+P[3]+P[4];

